# -*- coding: utf-8 -*-
BROKER_IP = 0
BROKER_PORT = 1
BROKER_ID= 2
BROKER_VERSION = 3
BROKER_DLL_TYPE = 4
BROKER_QSID = 5
BROKER_ACCOUNT_TYPE = 6
#券商交易服务器和端口
broker_setting = {
            #u'兴业证券':['tdxwt.xyzq.com.cn',7758, 1,'6.55', 'trade.dll'],
			u'兴业证券':['222.77.188.101',7758, 1,'6.65', 'trade.dll'],
            u'华泰证券':["wt.htsc.com.cn",7708, 0, '6.0', 'trade_ht.dll'],
            u'中信建投':['59.42.241.68',7708, 1,'7.12', 'tradex.dll', 18, 8],
            u'东海证券':['58.216.221.142',7708, 10,'7.0', 'trade.dll'],
            u'东莞证券':['218.16.124.5',7708, 0,'6.0', 'trade.dll'],
            u'红塔证券':['61.138.203.12',7708, 1,'6.00', 'trade.dll'],
            u'国金证券':['221.236.15.16',7708, 1,'7.02', 'trade.dll'],
            u'西部证券':['117.34.12.3',443, 1,'6.00', 'trade.dll'],
            u'海通证券':['TDX.htsec.com',7708, 0,'2.02', 'trade.dll'],
            u'东北证券':['61.139.133.19',7708, 1, '6.00', 'trade.dll'],
            u'华福证券':['tdxwt.hfzq.com.cn',8081, 1, '6.1', 'trade.dll'],
            u'广发证券':['101.226.255.198',7708, 0, '8.17', 'trade.dll'],
            u'西南证券':['222.178.70.12',7708, 1, '10.48', 'trade.dll'],
            u'国泰君安':['rzjy6.gtja.com',7708, 95,'9.40', 'trade.dll'],
            u'联储证券':['117.159.7.226',7708, 1,'6.36', 'trade.dll'],
            u'同信证券':['180.163.42.100',7708, 0,'6.0', 'trade.dll'],
            u'长城证券':['219.133.95.102',7708, 1, '6.00', 'trade.dll'],
            u'国联证券':['tdxhq.glsc.com.cn',7707, 1,'6.00', 'trade.dll'],
            u'银河证券':['114.251.2.71',7708, 181,'2.43', 'trade.dll'],
            u'中原证券':['218.29.101.53',7708, 1,'1.59', 'trade.dll'],
            u'华西证券':['119.4.167.162',7708, 1,'6.10', 'tradex.dll'],
            } 